InformationRegisters/СопоставлениеАдресации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СопоставлениеАдресации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФункционалВТекущейИБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФункционалВТекущейИБ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/УправлениеКонфигурацией/Ext/Module.bsl
Функция ПолучитьИДПользователя(ИмяПользователя) Экспорт
	 
	 ПользовательКонфигурации = ПользователиИнформационнойБазы.НайтиПоИмени(ИмяПользователя);
	 Если ПользовательКонфигурации = Неопределено Тогда
		 Возврат Неопределено;
	 КонецЕсли;
	 
	 Возврат ПользовательКонфигурации.УникальныйИдентификатор;
	  
 КонецФункции
 
Функция ПолучитМассивАдресовСледующихАресатов(имяТекущейТочки) Экспорт
	 
	 точкиПерехода = Новый Структура("РуководительИсполнителей,Исполнитель","Руководитель исполнителей", "Исполнитель");
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	                |	СопоставлениеАдресации.Пользователь.АдресЭлектроннойПочты КАК АдресЭлектроннойПочты
	                |ИЗ
	                |	РегистрСведений.СопоставлениеАдресации КАК СопоставлениеАдресации
	                |ГДЕ
	                |	СопоставлениеАдресации.ФункционалВТекущейИБ.ИмяПредопределенныхДанных = &функцииВИБ";
	 Запрос.УстановитьПараметр("функцииВИБ", точкиПерехода[имяТекущейТочки]);	 
	 
	 адресаМассив = Новый Массив;
	 
	 Выборка = Запрос.Выполнить().Выбрать();
	 Пока Выборка.Следующий() Цикл
		 адресаМассив.Добавить(Выборка.АдресЭлектроннойПочты);
	 КонецЦикла;

	 Возврат адресаМассив;
	 
КонецФункции
